Tekla.Structures.Analysis.Analysis
The Analysis class is a class from which the user can query analysis instances.
using Tekla.Structures.Analysis;
public class Class
{
public void Example()
{
Analysis Analysis = new Analysis();
}
}

Tekla.Structures.Analysis.Analysis.#ctor
Creates a new analysis instance to the Tekla Structures Analysis and Design.

Tekla.Structures.Analysis.Analysis.GetAnalysisObjectSelector
Returns the analysis object selector.
Returns: The analysis object selector on success.

Tekla.Structures.Analysis.Analysis.GetConnectionStatus
Checks the connection status of the Tekla Structures process.
Returns: True if a proper connection to the Tekla Structures process has been established.
Currently there's no way to re-establish the connection.

Tekla.Structures.Analysis.Analysis.GetClientId
Gets the unique client id for an application.
The client id must be used with sequential queries, like object enumeration.
Returns: Returns the client id.

Tekla.Structures.Analysis.Analysis.GetCorrectInstance(System.String,Tekla.Structures.Identifier,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,Tekla.Structures.Identifier,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,Tekla.Structures.Identifier,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32)
Gets the correct instances of an object.
AnalysisModelName: The name of the analysis model.
AnalysisObjectID: The identifier of the analysis object.
AnalysisObjectType: The type of the analysis object.
FatherObjectID: The identifier of the father analysis object.
FatherObjectType: The type of the father analysis object.
FatherObject2ID: The identifier of the father analysis object 2.
FatherObject2Type: The type of the father analysis object 2.
AdditionalId: The additional identifier to be used.
Returns: Returns the correct analysis object instance.

Tekla.Structures.Analysis.Analysis.SelectAnalysisObject(System.String,Tekla.Structures.Identifier,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,Tekla.Structures.Identifier,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,Tekla.Structures.Identifier,Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum,System.Int32)
Selects an analysis object.
AnalysisModelName: The name of the analysis model.
AnalysisObjectID: The identifier of the analysis object.
AnalysisObjectType: The type of the analysis object.
FatherObjectID: The identifier of the father analysis object.
FatherObjectType: The type of the father analysis object.
FatherObject2ID: The identifier of the father analysis object 2.
FatherObject2Type: The type of the father analysis object 2.
AdditionalId: The additional identifier to be used.
Returns: Returns an analysis object.